## Q-1. Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

SELECT SUBSTRING(first_name,1,3) as First_name FROM Worker

## Q-2. Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

SELECT LOCATE(‘a’,Amitabh) FROM Worker

## Q-3. Write an SQL query to print the name of employees having the highest salary in each department.

###### WITH CTE as(SELECT  Employee_Name,Department , ROUND(AVG(salary),2) as Highest_salary from employee 
            WHERE Salary in (select  DISTINCT MAX(Salary) over (partition by Department) from employee)group by 1,2)
SELECT Employee_Name from CTE